app/controllers/posts_controller.rb

  def index
    # "Post.all"は全てのPostデータを取り出すコード
    # "order(created_at: :desc)"は出力される順番を新規が上部になるよう変更するコード
    @posts = Post.all.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def show
    # 投稿データーを取得するコード
    @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    # "content"が入力データであるインスタンスを作成している
    @post = Post.new(content: params[:content])
    @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "flying tiger Copenhagen "], ["created_at", "2020-08-10 17:54:02.369915"], ["updated_at", "2020-08-10 17:54:02.369915"]]