app/controllers/users_controller.rb

  def create
    @user = User.new(name: params[:name], email: params[:email])
    @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Chinatsu"], ["email", "chinatsu@gmail.com"], ["created_at", "2020-08-12 00:31:04.161677"], ["updated_at", "2020-08-12 00:31:04.161677"]]